In [4]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('../data/interim/retail.db')

In [5]:
pd.read_sql('SELECT * FROM sales LIMIT 5', conn)

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [1]:
import sqlite3
import pandas as pd

# Connect to your database
conn = sqlite3.connect('../data/interim/retail.db')

# Check connection works
df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)
df

    name
0  sales

In [2]:
pd.read_sql("PRAGMA table_info('sales')", conn)

   cid   name     type  notnull dflt_value  pk
0    0   date     TEXT        0       None   0
1    1  store  INTEGER        0       None   0
2    2   item  INTEGER        0       None   0
3    3  sales  INTEGER        0       None   0

In [3]:
pd.read_sql("SELECT * FROM sales LIMIT 5", conn)

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [4]:
pd.read_sql("""
    SELECT store, SUM(sales) as total_sales
    FROM sales
    GROUP BY store
    ORDER BY total_sales DESC
    LIMIT 5
""", conn)

   store  total_sales
0      2       943732
1      8       787449
2      3       745232
3     10       720123
4      9       676693

In [5]:
# Look at the first 5 rows
df_sales = pd.read_sql("SELECT * FROM retail_sales LIMIT 5;", conn)
df_sales

DatabaseError: Execution failed on sql 'SELECT * FROM retail_sales LIMIT 5;': no such table: retail_sales

In [6]:
pd.read_sql("""
SELECT store, item, COUNT(*) as record_count
FROM retail_sales
GROUP BY store, item
ORDER BY record_count DESC
LIMIT 10;
""", conn)

DatabaseError: Execution failed on sql '
SELECT store, item, COUNT(*) as record_count
FROM retail_sales
GROUP BY store, item
ORDER BY record_count DESC
LIMIT 10;
': no such table: retail_sales

In [7]:
df_sales = pd.read_sql("SELECT * FROM sales LIMIT 5;", conn)
df_sales

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [8]:
sqlite-utils insert data/interim/retail.db sales data/raw/retail_sales_sample.csv --csv

SyntaxError: invalid syntax (958716766.py, line 1)